В этом уроке я:
* Познакомился с ключевым словом DISTINCT.
* Разобрался, как работают агрегирующие функции.
* Узнал разницу между COUNT(*) и COUNT(column).
* Научился совмещать фильтрацию и агрегацию в одном запросе.
* Поработал с массивами и узнали, что делает функция array_length.
* Узнал ещё больше про даты и время и познакомились с функцией AGE.
* Затронул более продвинутую тему — агрегатные выражения с фильтрацией.

Известные на текущий момент ключевые слова и порядок их написания в запросе:
- SELECT     -- перечисление полей результирующей таблицы
- FROM       -- указание источника данных
- WHERE      -- фильтрация данных
- ORDER BY   -- сортировка результирующей таблицы
- LIMIT      -- ограничение количества выводимых записей